Jim-tech/Iot/Z3Aliyun1/efr32/diagnostic.c
// Output an array of 32 bit values, 4 per line, each preceded by its name.
void halPrintCrashData(uint8_t port)
{
  uint32_t *data = (uint32_t *)&halResetInfo.crash.R0;
  char const *name = nameStrings;
  char const *separator;
  uint8_t i = 0;

  while (*name != '\0') {
    emberSerialPrintf(port, "%p = %4x", name, *data++);
    // increment pointer to end of name
    while (*name != '\0') {
      name++;
    }
    // increment past null pointer for next name
    name++;

    /*lint -save -e448 */
    separator = ((*name != '\0') && ((i & 3) != 3)) ? ", " : "\r\n";

    /*lint -restore */
    emberSerialPrintf(port, separator);
    emberSerialWaitSend(port);
    i++;
  }
}

uint16_t halGetPCDiagnostics(void)
{
  return 0;
}

void halStartPCDiagnostics(void)
{
}

void halStopPCDiagnostics(void)
{
}


/*Add by Jim*/
CrashRecc g_crashRecord;

void emberCrashRecordInit(uint8_t port)
{
	halInternalResetWatchDog();
	if (0 != halAppBootloaderInit()) {
		emberSerialPrintfLine(port, "BTL Interface Init failed");
	} else {
		halAppBootloaderReadRawStorage(CRASH_RECC_FLASH_ADDR, (uint8_t *)&g_crashRecord, sizeof(CrashRecc));
		if (g_crashRecord.lastRec >= CRASH_RECC_MAX_REC) {
			g_crashRecord.lastRec = 0;
			emberSerialPrintfLine(port, "Crash record init");
			memset(&g_crashRecord, 0, sizeof(g_crashRecord));
			halAppBootloaderEraseRawStorage(CRASH_RECC_FLASH_ADDR, FLASH_PAGE_SIZE);
			halAppBootloaderWriteRawStorage(CRASH_RECC_FLASH_ADDR, (uint8_t *)&g_crashRecord, sizeof(CrashRecc));
		}
	}
}

void emberCrashRecordSave(uint8_t port)
{
	uint8_t index = g_crashRecord.lastRec;

	halInternalResetWatchDog();
	g_crashRecord.resetinfo[index] = halGetResetInfo();
	g_crashRecord.ext_resetinfo[index] = halGetExtendedResetInfo();
	memcpy(&(g_crashRecord.crashRec[index]), &halResetInfo.crash, sizeof(HalCrashInfoType));
	g_crashRecord.lastRec = (g_crashRecord.lastRec + 1) % CRASH_RECC_MAX_REC;
	halAppBootloaderEraseRawStorage(CRASH_RECC_FLASH_ADDR, FLASH_PAGE_SIZE);
	halAppBootloaderWriteRawStorage(CRASH_RECC_FLASH_ADDR, (uint8_t *)&g_crashRecord, sizeof(CrashRecc));
	emberSerialPrintfLine(port, "Crash record saved");
}

void halPrintCrashSummaryByRec(uint8_t port, uint8_t index)
{
  HalCrashInfoType *c = &(g_crashRecord.crashRec[index]);
  uint32_t sp, stackBegin, stackEnd, size, used;
  uint16_t pct;
  uint8_t *mode;
  const char *stack;
  uint8_t bit;

  if (c->LR & 4) {
    stack = "process";
    sp = c->processSP;
    used = c->processSPUsed;
    stackBegin = 0;
    stackEnd = 0;
  } else {
    stack = "main";
    sp = c->mainSP;
    used = c->mainSPUsed;
    stackBegin = (uint32_t)c->mainStackBottom;
    stackEnd = (uint32_t)(uint8_t *)_CSTACK_SEGMENT_END;
  }

  mode = (uint8_t *)((c->LR & 8) ? "Thread" : "Handler");
  size = stackEnd - stackBegin;
  pct = size ? (uint16_t)(((100 * used) + (size / 2)) / size) : 0;
  emberSerialPrintfLine(port, "%p mode using %p stack (%4x to %4x), SP = %4x",
                        mode, stack, stackBegin, stackEnd, sp);
  emberSerialPrintfLine(port, "%u bytes used (%u%%) in %p stack"
                              " (out of %u bytes total)",
                        (uint16_t)used, pct, stack, (uint16_t)size);
  if ( !(c->LR & 4) && (used == size - 4 * RESETINFO_WORDS)
       && (c->mainStackBottom < (uint32_t)(uint8_t *)_RESETINFO_SEGMENT_END)) {
    // Here the stack overlaps the RESETINFO region and when we checked
    // stack usage we avoided checking that region because we'd already
    // started using it -- so if we found the stack almost full to that
    // point, warn that it might actually have been completely full.
    emberSerialPrintfLine(port, "Stack _may_ have used up to 100%% of total.");
  }
  // Valid SP range is [stackBegin, stackEnd] inclusive, but contents
  // of stack only go into [stackBegin, stackend).
  if ((sp > stackEnd) || (sp < stackBegin)) {
    emberSerialPrintfLine(port, "SP is outside %p stack range!", stack);
  }
  emberSerialWaitSend(port);

#if defined(CORTEXM3_EFM32_MICRO) || defined (_EFR_DEVICE)
  if (c->intActive.word[0] || c->intActive.word[1]) {
    emberSerialPrintf(port, "Interrupts active (or pre-empted and stacked):");
    for (bit = 0; bit < 32; bit++) {
      if ((c->intActive.word[0] & (1 << bit)) && (*intActiveBits[bit] != '\0')) {
        emberSerialPrintf(port, " %p", intActiveBits[bit]);
      }
    }
    for (bit = 0; bit < (sizeof(intActiveBits) / sizeof(intActiveBits[0])) - 32; bit++) {
      if ((c->intActive.word[1] & (1 << bit)) && (*intActiveBits[bit + 32] != '\0')) {
        emberSerialPrintf(port, " %p", intActiveBits[bit + 32]);
      }
    }
    emberSerialPrintCarriageReturn(port);
  }
#else
  if (c->intActive.word) {
    emberSerialPrintf(port, "Interrupts active (or pre-empted and stacked):");
    for (bit = INT_TIM1_BIT; bit <= INT_DEBUG_BIT; bit++) {
      if ((c->intActive.word & (1 << bit)) && *intActiveBits[bit] ) {
        emberSerialPrintf(port, " %p", intActiveBits[bit]);
      }
    }
    emberSerialPrintCarriageReturn(port);
  }
#endif
  else {
    emberSerialPrintfLine(port, "No interrupts active");
  }
}

void halPrintCrashDetailsByRec(uint8_t port, uint8_t index)
{
  HalCrashInfoType *c = &(g_crashRecord.crashRec[index]);
//  uint16_t reason = halGetExtendedResetInfo();
  uint16_t reason = g_crashRecord.ext_resetinfo[index];
  uint8_t bit;
  const uint8_t numFaults = sizeof(cfsrBits) / sizeof(cfsrBits[0]);

  switch (reason) {
    case RESET_WATCHDOG_EXPIRED:
      emberSerialPrintfLine(port, "Reset cause: Watchdog expired, no reliable extra information");
      emberSerialWaitSend(port);
      break;
    case RESET_WATCHDOG_CAUGHT:
      emberSerialPrintfLine(port, "Reset cause: Watchdog caught with enhanced info");
      emberSerialPrintfLine(port, "Instruction address: %4x", c->PC);
      emberSerialWaitSend(port);
      break;

    case RESET_CRASH_ASSERT:
      emberSerialPrintfLine(port, "Reset cause: Assert %p:%d",
                            c->data.assertInfo.file, c->data.assertInfo.line);
      emberSerialWaitSend(port);
      break;

    case RESET_FAULT_HARD:
      emberSerialPrintfLine(port, "Reset cause: Hard Fault");
      if (c->hfsr.bits.VECTTBL) {
        emberSerialPrintfLine(port,
                              "HFSR.VECTTBL: error reading vector table for an exception");
      }
      if (c->hfsr.bits.FORCED) {
        emberSerialPrintfLine(port,
                              "HFSR.FORCED: configurable fault could not activate");
      }
      if (c->hfsr.bits.DEBUGEVT) {
        emberSerialPrintfLine(port,
                              "HFSR.DEBUGEVT: fault related to debug - e.g., executed BKPT");
      }
      emberSerialWaitSend(port);
      break;

#if (__CORTEX_M >= 0x03)
    // The following faults don't exist on Cortex-M0+
    case RESET_FAULT_MEM:
      emberSerialPrintfLine(port, "Reset cause: Memory Management Fault");
      if (c->cfsr.bits.DACCVIOL || c->cfsr.bits.IACCVIOL) {
        emberSerialPrintfLine(port, "Instruction address: %4x", c->PC);
      }
      if (c->cfsr.bits.MMARVALID) {
        emberSerialPrintfLine(port, "Illegal access address: %4x", c->faultAddress);
      }
      for (bit = SCB_CFSR_MEMFAULTSR_Pos; bit < (SCB_CFSR_MEMFAULTSR_Pos + 8); bit++) {
        if ((c->cfsr.word & (1 << bit)) && (*cfsrBits[bit] != '\0')) {
          emberSerialPrintfLine(port, "CFSR.%p", cfsrBits[bit]);
        }
      }
      emberSerialWaitSend(port);
      break;

    case RESET_FAULT_BUS:
      emberSerialPrintfLine(port, "Reset cause: Bus Fault");
      emberSerialPrintfLine(port, "Instruction address: %4x", c->PC);
      if (c->cfsr.bits.IMPRECISERR) {
        emberSerialPrintfLine(port,
                              "Address is of an instruction after bus fault occurred, not the cause.");
      }
      if (c->cfsr.bits.BFARVALID) {
        emberSerialPrintfLine(port, "Illegal access address: %4x",
                              c->faultAddress);
      }
      for (bit = SCB_CFSR_BUSFAULTSR_Pos; bit < SCB_CFSR_USGFAULTSR_Pos; bit++) {
        if (((c->cfsr.word >> bit) & 1U) && (*cfsrBits[bit] != '\0')) {
          emberSerialPrintfLine(port, "CFSR.%p", cfsrBits[bit]);
        }
      }
      if ((c->cfsr.word & 0xFF) == 0) {
        emberSerialPrintfLine(port, "CFSR.(none) load or store at an illegal address");
      }
      emberSerialWaitSend(port);
      break;

    case RESET_FAULT_USAGE:
      emberSerialPrintfLine(port, "Reset cause: Usage Fault");
      emberSerialPrintfLine(port, "Instruction address: %4x", c->PC);
      for (bit = SCB_CFSR_USGFAULTSR_Pos;
           (bit < numFaults) && (bit < (sizeof(c->cfsr.word) * 8));
           bit++) {
        if (((c->cfsr.word >> bit) & 1U) && (*cfsrBits[bit] != '\0')) {
          emberSerialPrintfLine(port, "CFSR.%p", cfsrBits[bit]);
        }
      }
      emberSerialWaitSend(port);
      break;
#endif // (__CORTEX_M >= 0x03)

    case RESET_FAULT_DBGMON:
      emberSerialPrintfLine(port, "Reset cause: Debug Monitor Fault");
      emberSerialPrintfLine(port, "Instruction address: %4x", c->PC);
      emberSerialWaitSend(port);
      break;

    default:
      break;
  }
}

// Output an array of 32 bit values, 4 per line, each preceded by its name.
void halPrintCrashDataByRec(uint8_t port, uint8_t index)
{
  uint32_t *data = &(g_crashRecord.crashRec[index].R0);
  char const *name = nameStrings;
  char const *separator;
  uint8_t i = 0;

  while (*name != '\0') {
    emberSerialPrintf(port, "%p = %4x", name, *data++);
    // increment pointer to end of name
    while (*name != '\0') {
      name++;
    }
    // increment past null pointer for next name
    name++;

    /*lint -save -e448 */
    separator = ((*name != '\0') && ((i & 3) != 3)) ? ", " : "\r\n";

    /*lint -restore */
    emberSerialPrintf(port, separator);
    emberSerialWaitSend(port);
    i++;
  }
}

uint8_t emberGetMaxCrashRecordNum()
{
	return CRASH_RECC_MAX_REC;
}

uint8_t emberGetLastCrashRecordIndex()
{
	return (g_crashRecord.lastRec + CRASH_RECC_MAX_REC - 1) % CRASH_RECC_MAX_REC;
}

void emberCrashRecordDump(uint8_t port, uint8_t index)
{
	uint8_t reset_info = g_crashRecord.resetinfo[index];
	if (0xFF != reset_info && hal_ResetInfoWasCrash(reset_info)) {
		halPrintCrashSummaryByRec(port, index);
		halPrintCrashDetailsByRec(port, index);
		halPrintCrashDataByRec(port, index);
	}
}
/*End add*/
